$(document).ready(function() {

    var url = location.href;
    var q = url.split("?");

    var textcont = new Array('在松前町公園，粉白、粉紅的垂櫻及整樹櫻花，在松前城搖曳，這裡的春天不僅空氣好、視野好、心境更好。櫻花很美，但美的不僅是它花開時的容顏，也包含了盛開後的昇華。在這裡，看到顆顆嬌嫩的花蕊，及灑在水面的片片花海，更會令您欣喜收下了這份春天禮物。','在富良野，夏天的薰衣草鋪滿了整片的山野，一道道的薰衣草田，彷彿是他用盡全力跑步過的痕跡。坐下來後更會發現，富良野的這塊薰衣草拼布，不僅有塞滿滿的紫色，還夾雜了其他各種的花色，這樣與薰衣草搭配的七彩花田，化作太陽底下最繽紛的畫布。','紅色的楓葉、微涼的空氣，時間彷彿在此靜止。雖然楓葉豔得如火，但每當樹梢上多了一片紅葉，時間竟然就慢了那麼一點。寂靜如絲、慢行如流的氣氛，不知不覺隨著楓葉一片片的出現而愈來愈濃烈。因此，當你拆開秋天的北海道，會發現與濃烈鮮艷完全相反的，安詳的禪意。','整片雪白覆蓋的大地，應該是了無生機、一片沉寂。但在北海道，這個由白色來統一色系的季節，卻讓人嗅出了希望。冬天，就像是一個長者給予北海道的關懷，雖然你看不到，卻感受得到每一株幼苗在雪地下滋長，他們都在等待融化的雪水，給予他們成長的養分。雪白不是冷漠，反而是一份低調溫暖的禮物。')

    console.log(q[1]);
    load(q[1]);

    $('.box.a').click(function() {
        load('a');
    });
    $('.box.b').click(function() {
        load('b');
    });
    $('.box.c').click(function() {
        load('c');
    });
    $('.box.d').click(function() {
        load('d');
    });

});


function load(x) {
	    var textcont = new Array('粉白、粉紅的垂櫻及整樹櫻花，在松前城搖曳，這裡的春天不僅空氣好、視野好、心境更好。櫻花很美，但美的不僅是它花開時的容顏，也包含了盛開後的昇華。在這裡，看到顆顆嬌嫩的花蕊，及灑在水面的片片花海，更會令您欣喜收下了這份春天禮物。','夏天的薰衣草鋪滿了整片的山野，一道道的薰衣草田，彷彿是他用盡全力跑步過的痕跡。坐下來後更會發現，富良野的這塊薰衣草拼布，不僅有塞滿滿的紫色，還夾雜了其他各種的花色，這樣與薰衣草搭配的七彩花田，化作太陽底下最繽紛的畫布。','紅色的楓葉、微涼的空氣，時間彷彿在此靜止。雖然楓葉豔得如火，但每當樹梢上多了一片紅葉，時間竟然就慢了那麼一點。寂靜如絲、慢行如流的氣氛，不知不覺隨著楓葉一片片的出現而愈來愈濃烈。因此，當你拆開秋天的北海道，會發現與濃烈鮮艷完全相反的，安詳的禪意。','整片雪白覆蓋的大地，應該是了無生機、一片沉寂。但在北海道，這個由白色來統一色系的季節，卻讓人嗅出了希望。冬天，就像是一個長者給予北海道的關懷，雖然你看不到，卻感受得到每一株幼苗在雪地下滋長，他們都在等待融化的雪水，給予他們成長的養分。雪白不是冷漠，反而是一份低調溫暖的禮物。')

    switch (x) {
        case 'a':
            $('.box').removeClass('show');
            $('.box.a').addClass('show');
            $('.img').removeClass('b c d');
            $('.img').addClass('a');
            $('.text').text(textcont[0]);
            break;
        case 'b':
            $('.box').removeClass('show');
            $('.box.b').addClass('show');
            $('.img').removeClass('a c d');
            $('.img').addClass('b');
            $('.text').text(textcont[1]);
            break;

        case 'c':
            $('.box').removeClass('show');
            $('.box.c').addClass('show');
            $('.img').removeClass('a b d');
            $('.img').addClass('c');
            $('.text').text(textcont[2]);
            break;

        case 'd':
            $('.box').removeClass('show');
            $('.box.d').addClass('show');
            $('.img').removeClass('a b c');
            $('.img').addClass('d');
            $('.text').text(textcont[3]);
            break;

    }
}
